soluciones en el prestador/appliance/transacciones-ejemplos/ITI41.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:ihe:iti:xds-b:2007" xmlns:urn1="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0" xmlns:urn2="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0">
	<soapenv:Header/>
	<soapenv:Body>
		<urn:ProvideAndRegisterDocumentSetRequest>
			<urn1:SubmitObjectsRequest>
				<urn2:RegistryObjectList>

					 <!-- DOCUMENT ENTRY -->
					<urn2:ExtrinsicObject home="" id="1.2.16.858.2.10001442.67430.20241004103000.112.1" isOpaque="0" lid="" mimeType="text/xml" objectType="urn:uuid:7edca82f-054d-47f2-a032-9b2a5b5186c1" status="urn:oasis:names:tc:ebxml-regrep:StatusType:Approved">
												 
						<!-- FECHA DE CREACION DEL DOCUMENTO -->
						<urn2:Slot name="creationTime" slotType="">
							<urn2:ValueList>
								<urn2:Value>20241004103000</urn2:Value>
							</urn2:ValueList>
						</urn2:Slot>
						
						<!-- LENGUAJE DEL DOCUMENTO -->
						<urn2:Slot name="languageCode" slotType="">
							<urn2:ValueList>
								<urn2:Value>es-UY</urn2:Value>
							</urn2:ValueList>
						</urn2:Slot>

						<!-- FECHA DE INICIO DEL ACTO -->
						<urn2:Slot name="serviceStartTime" slotType="">
							<urn2:ValueList>
								<urn2:Value>20231027100500</urn2:Value>
							</urn2:ValueList>
						</urn2:Slot>

						<!-- FECHA DE FIN DEL ACTO -->
						<urn2:Slot name="serviceStopTime" slotType="">
							<urn2:ValueList>
								<urn2:Value>20241004103000</urn2:Value>
							</urn2:ValueList>
						</urn2:Slot>

						<!-- MRN DEL PACIENTE -->
						<urn2:Slot name="sourcePatientId" slotType="">
							<urn2:ValueList>
								<urn2:Value>MRNPrueba444555^^^&amp;2.16.858.2.10001442.72768.9&amp;ISO</urn2:Value>
							</urn2:ValueList>
						</urn2:Slot>

						<!-- ID DEL REPOSITORIO  -->
						<urn2:Slot name="repositoryUniqueId" slotType="">
							<urn2:ValueList>
								<urn2:Value>2.16.858.2.10001442.71867.2</urn2:Value>
							</urn2:ValueList>
						</urn2:Slot>

						<!-- INFORMACION DEL PACIENTE -->
						<urn2:Slot name="sourcePatientInfo" slotType="">
							<urn2:ValueList>
								<!--<#Identificador Persona en institución#>^^^&<#OID Assigning Authority#>&ISO~<#Documento Persona en institución#>^^^&<#OID Assigning Authority#>&ISO-->
								<urn2:Value>PID-3|MRNPrueba444555^^^&amp;2.16.858.2.10001442.72768.9&amp;ISO~19876543^^^&amp;2.16.858.2.10000675.68909&amp;ISO</urn2:Value>
								<!--<#Primer Apellido#>^<#Primer Nombre#>^<#Segundo Nombre#>^#Segundo apellido#^-->
								<urn2:Value>PID-5|Prueba^Auto^^Pruebas^</urn2:Value>
								<!--Fecha de nacimiento AAAAMMDD-->
								<urn2:Value>PID-7|20001122</urn2:Value>
								<!--Sexo, 0 – Desconocido; 1 – Masculino; 2 –Femenino; 9 – No aplica-->
								<urn2:Value>PID-8|2</urn2:Value>
							</urn2:ValueList>
						</urn2:Slot>

						<!-- TITULO -->
						<urn2:Name>
							<urn2:LocalizedString charset="" xml:lang="es-uy" value="Consulta ambulatorio no urgente"/>
						</urn2:Name>

						<!-- DESCRIPCION -->
						<urn2:Description>
							<urn2:LocalizedString charset="" xml:lang="es-uy" value="Descripcion de consulta ambulatorio no urgente"/>
						</urn2:Description>

						<!-- AUTOR DEL DOCUMENTO-->
						<urn2:Classification classificationNode="" classificationScheme="urn:uuid:93606bcf-9494-43ec-9b4e-a7748d1a838d" classifiedObject="1.2.16.858.2.10001442.67430.20241004103000.112.1" home="" id="cl01" lid="" nodeRepresentation="" objectType="" status="">
							<urn2:Slot name="authorPerson" slotType="">
								<urn2:ValueList>
									<urn2:Value>12345678^LOPEZ^PABLO^k^u^k&amp;2.16.858.0.0.2.1&amp;ISO</urn2:Value>
								</urn2:ValueList>
							</urn2:Slot>
							<urn2:Slot name="authorInstitution" slotType="">
								<urn2:ValueList>
									<urn2:Value>ASSE^^^^^^^^^2.16.858.2.10001442.72768.9</urn2:Value>
								</urn2:ValueList>
							</urn2:Slot>
							<urn2:Slot name="authorRole" slotType="">
								<urn2:ValueList>
									<urn2:Value>Medico General</urn2:Value>
								</urn2:ValueList>
							</urn2:Slot>
							<urn2:Slot name="authorSpecialty" slotType="">
								<urn2:ValueList>
									<urn2:Value>Medicina general</urn2:Value>
								</urn2:ValueList>
							</urn2:Slot>
							<urn2:Name>
								<urn2:LocalizedString charset="" xml:lang="es-uy" value=""/>
							</urn2:Name>
						</urn2:Classification>

						<!-- CLASS CODE: TIPO GENERAL DE DOCUMENTO LOINC (EJE 1) -->
						<urn2:Classification classificationNode="" classificationScheme="urn:uuid:41a5887f-8865-4c09-adf7-e362475b143a" classifiedObject="1.2.16.858.2.10001442.67430.20241004103000.112.1" home="" id="cl02" lid="" nodeRepresentation="34746-8" objectType="" status="">
							<urn2:Slot name="codingScheme" slotType="">
								<urn2:ValueList>
									<urn2:Value>2.16.840.1.113883.6.1</urn2:Value>
								</urn2:ValueList>
							</urn2:Slot>
							<urn2:Name>
								<urn2:LocalizedString charset="" xml:lang="es-uy" value="Hoja de enfermería"/>
							</urn2:Name>
						</urn2:Classification>

						<!-- TYPE CODE: TIPO PRECISO DE DOCUMENTO SNOMED (EJE 2) -->
						<urn2:Classification classificationNode="" classificationScheme="urn:uuid:f0306f51-975f-434e-a61c-c59651d33983" classifiedObject="1.2.16.858.2.10001442.67430.20241004103000.112.1" home="" id="cl04" lid="" nodeRepresentation="11429006" objectType="" status="">
							<urn2:Slot name="codingScheme" slotType="">
								<urn2:ValueList>
									<urn2:Value>2.16.840.1.113883.6.96</urn2:Value>
								</urn2:ValueList>
							</urn2:Slot>
							<urn2:Name>
								<urn2:LocalizedString charset="" xml:lang="es-uy" value="Consulta (procedimiento)"/>
							</urn2:Name>
						</urn2:Classification>

						<!-- PRACTICE SETTING CODE: DETALLE DE DOCUMENTO SNOMED (EJE 3) -->
						<urn2:Classification classificationScheme="urn:uuid:cccf5598-8b07-4b77-a05e-ae952c785ead" classifiedObject="1.2.16.858.2.10001442.67430.20241004103000.112.1" id="cl07" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" nodeRepresentation="444561001">
							<urn2:Name>
								<urn2:LocalizedString value="Certificado de enfermría"/>
							</urn2:Name>
							<urn2:Slot name="codingScheme">
								<urn2:ValueList>
									<urn2:Value>2.16.840.1.113883.6.96</urn2:Value>
								</urn2:ValueList>
							</urn2:Slot>
						</urn2:Classification>

						<!-- NIVEL DE CONFIDENCIALIDAD DEL DOCUMENTO -->
						<urn2:Classification classificationNode="" classificationScheme="urn:uuid:f4f85eac-e6cb-4883-b524-f2705394840f" classifiedObject="1.2.16.858.2.10001442.67430.20241004103000.112.1" home="" id="cl03" lid="" nodeRepresentation="N" objectType="" status="">
							<urn2:Slot name="codingScheme" slotType="">
								<urn2:ValueList>
									<urn2:Value>2.16.840.1.113883.5.25</urn2:Value>
								</urn2:ValueList>
							</urn2:Slot>
							<urn2:Name>
								<urn2:LocalizedString charset="" xml:lang="es-uy" value="Normal"/>
							</urn2:Name>
						</urn2:Classification>

						<!-- FINANCIADOR -->
						<urn2:Classification classificationScheme="unr:uuid:b7651c00-0da2-11e8-9e6f-005056012055" classifiedObject="1.2.16.858.2.10001442.67430.20241004103000.112.1" id="cl07" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" nodeRepresentation="444561001">
							<urn2:Name>
								<urn2:LocalizedString value="Financiador..."/>
							</urn2:Name>
							<urn2:Slot name="funderOID">
								<urn2:ValueList>
									<urn2:Value>OID.financiador</urn2:Value>
								</urn2:ValueList>
							</urn2:Slot>
							<urn2:Slot name="funderName">
								<urn2:ValueList>
									<urn2:Value>Financiador</urn2:Value>
								</urn2:ValueList>
							</urn2:Slot>
						</urn2:Classification>
 
						<!-- POR ORDEN DE -->
						<urn2:Classification classificationScheme="unr:uuid:b7651c00-0da2-11e8-9e6f-005056012100" classifiedObject="1.2.16.858.2.10001442.67430.20241004103000.112.1" id="cl07" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" nodeRepresentation="444561001">
							<urn2:Name>
								<urn2:LocalizedString value="Certificado de eje 8"/>
							</urn2:Name>
							<urn2:Slot name="byOrderOfOID">
								<urn2:ValueList>
									<urn2:Value>OID.porordende</urn2:Value>
								</urn2:ValueList>
							</urn2:Slot>
							<urn2:Slot name="byOrderOfName">
								<urn2:ValueList>
									<urn2:Value>por Orden de</urn2:Value>
								</urn2:ValueList>
							</urn2:Slot>
						</urn2:Classification>

						<!-- EXTERNAL IDS -->
						
						<!-- MRN DEL PACIENTE -->
						<urn2:ExternalIdentifier home="" id="ei01" identificationScheme="urn:uuid:58a6f841-87b3-4a3e-92fd-a8ffeff98427" lid="" objectType="" registryObject="1.2.16.858.2.10001442.67430.20241004103000.112.1" status="" value="MRNPrueba444555^^^&amp;2.16.858.2.10001442.72768.9&amp;ISO">
							<urn2:Name>
								<urn2:LocalizedString charset="" value="XDSDocumentEntry.patientId"/>
							</urn2:Name>
						</urn2:ExternalIdentifier>

						<!-- OID UNICO DEL DOCUMENTO -->
						<urn2:ExternalIdentifier home="" id="ei02" identificationScheme="urn:uuid:2e82c1f6-a085-4c72-9da3-8640a32e42ab" lid="" objectType="" registryObject="1.2.16.858.2.10001442.67430.20241004103000.112.1" status="" value="2.16.858.2.10001442.67430.20241004103000.112.1">
							<urn2:Name>
								<urn2:LocalizedString charset="" xml:lang="es-uy" value="XDSDocumentEntry.uniqueId"/>
							</urn2:Name>
						</urn2:ExternalIdentifier>

					</urn2:ExtrinsicObject>


					<!-- SUBMISSION SET -->
					<urn2:RegistryPackage home="" id="2.2.16.858.2.10001442.67430.20241004103000.112.1" lid="" objectType="" status="urn:oasis:names:tc:ebxml-regrep:StatusType:Approved">
						
						<!-- FECHA DE CREACION DEL ENVIO -->
						<urn2:Slot name="submissionTime" slotType="">
							<urn2:ValueList>
								<urn2:Value>20241004103000</urn2:Value>
							</urn2:ValueList>
						</urn2:Slot>

						<!-- TITULO -->
						<urn2:Name>
							<urn2:LocalizedString charset="" xml:lang="es-uy" value="Consulta medicina general"/>
						</urn2:Name>

						<!-- DESCRIPCION -->
						<urn2:Description>
							<urn2:LocalizedString charset="" xml:lang="es-uy" value=""/>
						</urn2:Description>

						<!-- AUTOR DEL ENVIO -->
						<urn2:Classification classificationNode="" classificationScheme="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e12d" classifiedObject="2.2.16.858.2.10001442.67430.20241004103000.112.1" home="" id="urn:uuid:a7058bb9-b4e4-4307-basx-e3f0ab85e11d" lid="" nodeRepresentation="" objectType="" status="">
							<urn2:Slot name="authorPerson" slotType="">
								<urn2:ValueList>
									<urn2:Value>12345678^LOPEZ^PABLO^k^u^k&amp;2.16.858.0.0.2.1&amp;ISO</urn2:Value>
								</urn2:ValueList>
							</urn2:Slot>
							<urn2:Slot name="authorInstitution" slotType="">
								<urn2:ValueList>
									<urn2:Value>ASSE^^^^^^^^^2.16.858.2.10001442.72768.1</urn2:Value>
								</urn2:ValueList>
							</urn2:Slot>
							<urn2:Slot name="authorRole" slotType="">
								<urn2:ValueList>
									<urn2:Value>Medico</urn2:Value>
								</urn2:ValueList>
							</urn2:Slot>
							<urn2:Name>
								<urn2:LocalizedString charset="" xml:lang="es-uy" value="ejemplo"/>
							</urn2:Name>
						</urn2:Classification>

						<!-- CODIGO DEL TIPO PRECISO DE DOCUMENTO SNOMED (EJE 2) -->
						<urn2:Classification classificationNode="" classificationScheme="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500" classifiedObject="2.2.16.858.2.10001442.67430.20241004103000.112.1" home="" id="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e55e" lid="" nodeRepresentation="" objectType="" status="">
							<urn2:Slot name="codingScheme" slotType="">
								<urn2:ValueList>
									<urn2:Value>SNOMED-CT</urn2:Value>
								</urn2:ValueList>
							</urn2:Slot>
							<urn2:Name>
								<urn2:LocalizedString charset="" xml:lang="es-uy" value="Nota de consulta"/>
							</urn2:Name>
						</urn2:Classification>

						<!-- EXTERNAL IDS -->

						<!-- IDENTIFICADOR DEL PACIENTE -->
						<urn2:ExternalIdentifier home="" id="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab854321" identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832" lid="" objectType="" registryObject="2.2.16.858.2.10001442.67430.20241004103000.112.1" status="" value="${#Project#OIDPrestador1}">
							<urn2:Name>
								<urn2:LocalizedString charset="" xml:lang="es-uy" value="XDSSubmissionSet.sourceId"/>
							</urn2:Name>
						</urn2:ExternalIdentifier>

						<!-- MRN DEL PACIENTE -->
						<urn2:ExternalIdentifier home="" id="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85r21q" identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446" lid="" objectType="" registryObject="2.2.16.858.2.10001442.67430.20241004103000.112.1" status="" value="MRNPrueba444555^^^&amp;2.16.858.2.10001442.72768.9&amp;ISO">
							<urn2:Name>
								<urn2:LocalizedString charset="" value="XDSSubmissionSet.patientId"/>
							</urn2:Name>
						</urn2:ExternalIdentifier>

						<!--  OID UNICO DEL DOCUMENTO -->
						<urn2:ExternalIdentifier home="" id="urn:uuid:a7058bb9-b4e4-4307-ba5b-e3f0ab85e23w" identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8" lid="" objectType="" registryObject="2.2.16.858.2.10001442.67430.20241004103000.112.1" status="" value="2.16.858.2.10001442.67430.20241004103000.112.1.2">
							<urn2:Name>
								<urn2:LocalizedString charset="" xml:lang="es-uy" value="XDSSubmissionSet.uniqueId"/>
							</urn2:Name>
						</urn2:ExternalIdentifier>

					</urn2:RegistryPackage>


					<!-- CLASIFICACION CREA SUBMISSION SET -->
					<urn2:Classification classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd" classificationScheme="" classifiedObject="2.2.16.858.2.10001442.67430.20241004103000.112.1" home="" id="" lid="" nodeRepresentation="" objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification" status="">
						<urn2:Slot name="" slotType="">
							<urn2:ValueList>
								<urn2:Value>creo SS</urn2:Value>
							</urn2:ValueList>
						</urn2:Slot>
						<urn2:Name>
							<urn2:LocalizedString charset="" xml:lang="es-uy" value="ejemplo"/>
						</urn2:Name>
					</urn2:Classification>


					<!-- ASOCIACION ENTRE DOCUMENT ENTRY Y SUBMISSION SET -->
					<urn2:Association associationType="urn:oasis:names:tc:ebxml-regrep:AssociationType:HasMember" home="" id="as01" lid="" objectType="" sourceObject="2.2.16.858.2.10001442.67430.20241004103000.112.1" status="" targetObject="1.2.16.858.2.10001442.67430.20241004103000.112.1">
						<urn2:Slot name="" slotType="">
							<urn2:ValueList>
								<urn2:Value>Original</urn2:Value>
							</urn2:ValueList>
						</urn2:Slot>
					</urn2:Association>
					
				</urn2:RegistryObjectList>
			</urn1:SubmitObjectsRequest>

			<!-- DOCUMENTO ADJUNTO -->
			<urn:Document id="1.2.16.858.2.10001442.67430.20231023152501.112.1">cid:1234321</urn:Document>

			
		</urn:ProvideAndRegisterDocumentSetRequest>
	</soapenv:Body>
</soapenv:Envelope>