examples/iti41_request_provide_register.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing"
            xmlns:s="http://www.w3.org/2003/05/soap-envelope">
   <s:Header>
      <a:Action s:mustUnderstand="1">urn:ihe:iti:2007:ProvideAndRegisterDocumentSet-b</a:Action>
      <a:MessageID>urn:uuid:6d63ca0c-4fb5-4bac-b60b-fcc4e4ef52b3</a:MessageID>
      <a:ReplyTo>
         <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
      </a:ReplyTo>
      <a:To s:mustUnderstand="1">http://localhost:9091/xds-iti41</a:To>
   </s:Header>
   <s:Body>
      <xdsb:ProvideAndRegisterDocumentSetRequest xmlns:lcm="urn:oasis:names:tc:ebxml-regrep:xsd:lcm:3.0"
                                                 xmlns:rim="urn:oasis:names:tc:ebxml-regrep:xsd:rim:3.0"
                                                 xmlns:rs="urn:oasis:names:tc:ebxml-regrep:xsd:rs:3.0"
                                                 xmlns:xdsb="urn:ihe:iti:xds-b:2007"
                                                 xmlns:xop="http://www.w3.org/2004/08/xop/include">
         <lcm:SubmitObjectsRequest>
            <rim:RegistryObjectList>
               <rim:RegistryPackage id="urn:uuid:d1dfadec-7700-4f81-a8d4-842a85222d35"
                                    objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:RegistryPackage">
                  <rim:Slot name="submissionTime">
                    <rim:ValueList>
                        <rim:Value>20200401071810</rim:Value>
                    </rim:ValueList>
                  </rim:Slot>
                  <rim:Name>
                    <rim:LocalizedString value="XDS Submission Set"/>
                  </rim:Name>
                  <rim:Classification classificationScheme="urn:uuid:aa543740-bdda-424e-8c96-df4873be8500"
                                      classifiedObject="urn:uuid:d1dfadec-7700-4f81-a8d4-842a85222d35"
                                      id="urn:uuid:b34eb647-6763-4abe-ad16-19602ba5df83"
                                      nodeRepresentation="UNSPECIFIED-CONTENT-TYPE"
                                      objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification">
                    <rim:Slot name="codingScheme">
                        <rim:ValueList>
                            <rim:Value>1.3.6.1.4.1.21367.2017.3</rim:Value>
                        </rim:ValueList>
                    </rim:Slot>
                    <rim:Name>
                        <rim:LocalizedString value="Unspecified Clinical Activity"/>
                    </rim:Name>
                  </rim:Classification>
                  <rim:Classification classificationNode="urn:uuid:a54d6aa5-d40d-43f9-88c5-b4633d873bdd"
                                      classifiedObject="urn:uuid:d1dfadec-7700-4f81-a8d4-842a85222d35"
                                      id="urn:uuid:55d7414a-0d98-4a78-9ae6-a708a275f0e5"
                                      objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:Classification"/>
                  <rim:ExternalIdentifier id="urn:uuid:351e8d5b-2cea-4d97-bb7b-0e07aed4d2b8"
                                          identificationScheme="urn:uuid:554ac39e-e3fe-47fe-b233-965d2a147832"
                                          objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier"
                                          registryObject="urn:uuid:d1dfadec-7700-4f81-a8d4-842a85222d35"
                                          value="1.3.6.1.4.1.21367.2012.2.1.1">
                    <rim:Name>
                        <rim:LocalizedString value="XDSSubmissionSet.sourceId"/>
                    </rim:Name>
                  </rim:ExternalIdentifier>
                  <rim:ExternalIdentifier id="urn:uuid:3dedba5c-e16b-44ee-97f7-2176f3cc520a"
                                          identificationScheme="urn:uuid:96fdda7c-d067-4183-912e-bf5ee74998a8"
                                          objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier"
                                          registryObject="urn:uuid:d1dfadec-7700-4f81-a8d4-842a85222d35"
                                          value="1.3.6.1.4.1.12559.11.1.2.2.1.1.4.146405">
                    <rim:Name>
                        <rim:LocalizedString value="XDSSubmissionSet.uniqueId"/>
                    </rim:Name>
                  </rim:ExternalIdentifier>
                  <rim:ExternalIdentifier id="3859e35d-78d0-40fa-a352-f2e48ae67fe7"
                                          identificationScheme="urn:uuid:6b5aea1a-874d-4603-a4bc-96a0a7b38446"
                                          objectType="urn:oasis:names:tc:ebxml-regrep:ObjectType:RegistryObject:ExternalIdentifier"
                                          registryObject="urn:uuid:d1dfadec-7700-4f81-a8d4-842a85222d35"
                                          value="121212^^^&amp;1.3.4.5&amp;ISO">
                    <rim:Name>
                        <rim:LocalizedString value="XDSSubmissionSet.patientId"/>
                    </rim:Name>
                  </rim:ExternalIdentifier>
               </rim:RegistryPackage>
            </rim:RegistryObjectList>
         </lcm:SubmitObjectsRequest>
      </xdsb:ProvideAndRegisterDocumentSetRequest>
   </s:Body>
</s:Envelope>

